class ApiErrorMapper {
  static String getArabicMessage(int? appCode) {
    switch (appCode) {
      case 210:
        return 'مطلوب استكمال البيانات الشخصية';

      case 211:
        return 'يرجى اختيار الدور';

      case 212:
        return 'يرجى استكمال الملف الصحي';

      case 310:
        return 'رقم الهاتف والبريد الإلكتروني وكلمة المرور مطلوبين';

      case 311:
        return 'صيغة البريد الإلكتروني غير صحيحة';

      case 312:
        return 'كلمة المرور يجب ألا تقل عن 8 أحرف وتحتوي على حروف';

      case 313:
        return 'صيغة رقم الهاتف غير صحيحة';

      case 314:
        return 'البريد الإلكتروني مسجل بالفعل';

      case 315:
        return 'رقم الهاتف مسجل بالفعل';

      case 316:
        return 'خطأ في الخادم، حاول مرة أخرى';

      case 317:
        return 'البريد الإلكتروني ورمز التحقق مطلوبان';

      case 318:
        return 'رمز التحقق غير صالح أو منتهي';

      case 319:
        return 'رمز التحقق غير صحيح';

      case 320:
        return 'يرجى الذهاب إلى البيانات الشخصية';

      case 321:
        return 'يرجى الذهاب إلى اختيار الدور';

      case 322:
        return 'البريد الإلكتروني أو الهاتف وكلمة المرور مطلوبين';

      case 323:
        return 'بيانات الدخول غير صحيحة';

      case 324:
        return 'المستخدم غير موجود، يرجى استكمال التسجيل';

      case 325:
        return 'يرجى استكمال الملف الصحي';

      case 326:
        return 'البريد الإلكتروني أو الهاتف أو كلمة المرور غير صحيحة';

      case 327:
        return 'خطأ في الخادم أثناء طلب إعادة تعيين كلمة المرور';

      case 328:
        return 'حقول مطلوبة مفقودة';

      case 329:
        return 'تم إرسال البيانات الشخصية مسبقًا';

      case 330:
        return 'خطأ في الخادم أثناء حفظ البيانات الشخصية';

      case 331:
        return 'الدور مطلوب';

      case 332:
        return 'تم اختيار الدور مسبقًا';

      case 333:
        return 'خطأ في الخادم أثناء اختيار الدور';

      case 334:
        return 'البريد الإلكتروني ورمز التحقق مطلوبان';

      case 335:
        return 'رمز التحقق غير صالح أو منتهي';

      case 336:
        return 'خطأ في الخادم أثناء التحقق من الرمز';

      case 337:
        return 'Refresh Token مطلوب';

      case 338:
        return 'Refresh Token غير صالح أو منتهي';

      case 339:
        return 'بيانات ناقصة';

      case 340:
        return 'رمز إعادة التعيين غير صالح';

      case 341:
        return 'المستخدم غير موجود';

      case 342:
        return 'خطأ في الخادم أثناء تأكيد كلمة المرور';

      case 343:
        return 'الملف الصحي متاح لكبار السن فقط';

      case 344:
        return 'تم إرسال الملف الصحي مسبقًا';

      case 345:
        return 'بيانات الملف الصحي غير مكتملة';

      case 346:
        return 'خطأ في الخادم أثناء إنشاء الملف الصحي';

      case 419:
        return 'المستخدم موجود بالفعل أثناء طلب رمز إعادة التعيين';

      case 420:
        return 'تم تسجيل الدخول بنجاح';

      case 452:
        return 'تم تسجيل الدخول بنجاح';

      case 997:
        return 'الاتصال بالسيرفر اتأخر.. حاول مرة أخرى';

      case 998:
        return 'تأكد من اتصال الإنترنت وحاول مرة أخرى';

      case 999:
        return 'يتم عمل صيانة في الوقت الحالي حاول لاحقا';

      default:
        return 'حدث خطأ غير متوقع';
    }
  }
}
